mentalibor/STM32f446RE_drivers/Inc/stm32f44xx_usart.h
/*
 * stm32f44xx_usart.h
 *
 *  Created on: Feb 7, 2021
 *      Author: Mentalibor
 */

#ifndef INC_STM32F44XX_USART_H_
#define INC_STM32F44XX_USART_H_

#include "stm32f44xx.h"

/*
 * Configuration structure for USARTx peripheral
 */
typedef struct
{
	uint8_t USART_Mode;				/*possible values at @USART_Mode*/
	uint32_t USART_Baud;			/*possible values at @USART_Baud*/
	uint8_t USART_NoOfStopBits;		/*possible values at @USART_ParityControl*/
	uint8_t USART_WordLength;		/*possible values at @USART_WordLength*/
	uint8_t USART_ParityControl;	/*possible values at @USART_NoOfStopBits*/
	uint8_t USART_HWFlowControl;	/*possible values at @USART_HWFlowControl*/
}USART_Config_t;


/*
 * Handle structure for USARTx peripheral
 */
typedef struct
{
	USART_RegDef_t *pUSARTx;
	USART_Config_t   USART_Config;
	uint8_t *pTxBuffer;
	uint8_t *pRxBuffer;
	uint32_t TxLen;
	uint32_t RxLen;
	uint8_t TxBusyState;
	uint8_t RxBusyState;
}USART_Handle_t;

/*
 *@USART_Mode
 *Possible options for USART_Mode
 */
#define USART_MODE_ONLY_TX 					0
#define USART_MODE_ONLY_RX 					1
#define USART_MODE_TXRX  					2

/*
 *@USART_Baud
 *Possible options for USART_Baud
 */
#define USART_STD_BAUD_1200					1200
#define USART_STD_BAUD_2400					2400
#define USART_STD_BAUD_9600					9600
#define USART_STD_BAUD_19200 				19200
#define USART_STD_BAUD_38400 				38400
#define USART_STD_BAUD_57600 				57600
#define USART_STD_BAUD_115200 				115200
#define USART_STD_BAUD_230400 				230400
#define USART_STD_BAUD_460800 				460800
#define USART_STD_BAUD_921600 				921600
#define USART_STD_BAUD_2M 					2000000
#define SUART_STD_BAUD_3M 					3000000


/*
 *@USART_ParityControl
 *Possible options for USART_ParityControl
 */
#define USART_PARITY_EN_ODD   				2
#define USART_PARITY_EN_EVEN  				1
#define USART_PARITY_DISABLE   				0

/*
 *@USART_WordLength
 *Possible options for USART_WordLength
 */
#define USART_WORDLEN_8BITS  				0
#define USART_WORDLEN_9BITS  				1

/*
 *@USART_NoOfStopBits
 *Possible options for USART_NoOfStopBits
 */
#define USART_STOPBITS_1     				0
#define USART_STOPBITS_0_5   				1
#define USART_STOPBITS_2     				2
#define USART_STOPBITS_1_5   				3

/*
 *@USART_HWFlowControl
 *Possible options for USART_HWFlowControl
 */
#define USART_HW_FLOW_CTRL_NONE    			0
#define USART_HW_FLOW_CTRL_CTS    			1
#define USART_HW_FLOW_CTRL_RTS    			2
#define USART_HW_FLOW_CTRL_CTS_RTS			3

/*
 * USART flags
 */

#define USART_FLAG_TXE 						( 1 << USART_SR_TXE)
#define USART_FLAG_RXNE 					( 1 << USART_SR_RXNE)
#define USART_FLAG_TC 						( 1 << USART_SR_TC)

/*
 * Application states
 */
#define USART_BUSY_IN_RX 					1
#define USART_BUSY_IN_TX 					2
#define USART_READY 						0


#define USART_EVENT_TX_CMPLT   				0
#define	USART_EVENT_RX_CMPLT   				1
#define	USART_EVENT_IDLE      				2
#define	USART_EVENT_CTS       				3
#define	USART_EVENT_PE        				4
#define	USART_ERR_FE     					5
#define	USART_ERR_NE    	 				6
#define	USART_ERR_ORE    					7

/******************************************************************************************
 *								APIs supported by this driver
 *		 For more information about the APIs check the function definitions
 ******************************************************************************************/
/*
 * Peripheral Clock setup
 */

/*******************************************************************************
 * @ingroup api_usart
 * @brief Enables or disables the USART/UART peripheral clock
 *
 * @param[in]   pUSARTx   	Reference to the USART/UART definition structure
 * @param[in]   EnorDi  	ENABLE/DISABLE macro
 *
 ******************************************************************************/
void USART_PeriClockControl ( USART_RegDef_t *pUSARTx
							, uint8_t EnorDi
							);

/*
 * Init and De-init
 */
/*******************************************************************************
 * @ingroup api_usart
 * @brief Initializes the USART/UART peripheral
 *
 * @param[in]   pUSARTHandle  Reference to the USART/UART handler
 *
 ******************************************************************************/
void USART_Init(USART_Handle_t *pUSARTHandle);

/*******************************************************************************
 * @ingroup api_usart
 * @brief Deinitializes the USART/UART peripheral
 *
 * @param[in]   pUSARTx  Reference to the USART/UART definition structure
 *
 ******************************************************************************/
void USART_DeInit(USART_RegDef_t *pUSARTx);

/*******************************************************************************
 * @ingroup api_usart
 * @brief Sets the baudrate of the USART/UART peripheral
 *
 * @param[in]   pUSARTx  	Reference to the USART/UART definition structure
 * @param[in]	BaudRate	Baudrate value
 *
 ******************************************************************************/
void USART_SetBaudRate	( USART_RegDef_t *pUSARTx
						, uint32_t BaudRate
						);

/*
 * Data Send and Receive
 */
/*******************************************************************************
 * @ingroup api_usart
 * @brief Sends data in blocking mode
 *
 * @param[in]   pUSARTHandle 	Reference to the USART/UART handler
 * @param[in]	pTxbuffer		Reference to the TX buffer
 * @param[in]	Len				Length of the TX buffer
 *
 ******************************************************************************/
void USART_SendData	( USART_Handle_t *pUSARTHandle
					, uint8_t *pTxBuffer
					, uint32_t Len
					);

/*******************************************************************************
 * @ingroup api_usart
 * @brief Receives data in blocking mode
 *
 * @param[in]   pUSARTHandle  	Reference to the USART/UART handler
 * @param[in]	pRxbuffer		Reference to the RX buffer
 * @param[in]	Len				Length of the TX buffer
 *
 ******************************************************************************/
void USART_ReceiveData	( USART_Handle_t *pUSARTHandle
						, uint8_t *pRxBuffer
						, uint32_t Len
						);

/*******************************************************************************
 * @ingroup api_usart
 * @brief Sends data in non-blocking mode
 *
 * @param[in]   pUSARTHandle 	Reference to the USART/UART handler
 * @param[in]	pTxbuffer		Reference to the TX buffer
 * @param[in]	Len				Length of the TX buffer
 *
 * @return uint8_t
 * @retval USART_BUSY_IN_RX
 * @retval USART_BUSY_IN_TX
 * @retval USART_READY
 ******************************************************************************/
uint8_t USART_SendDataIT ( USART_Handle_t *pUSARTHandle
						 , uint8_t *pTxBuffer
						 , uint32_t Len
						 );

/*******************************************************************************
 * @ingroup api_usart
 * @brief Receives data in non-blocking mode
 *
 * @param[in]   pUSARTHandle 	Reference to the USART/UART handler
 * @param[in]	pRxbuffer		Reference to the RX buffer
 * @param[in]	Len				Length of the RX buffer
 *
 * @return uint8_t
 * @retval USART_BUSY_IN_RX
 * @retval USART_BUSY_IN_TX
 * @retval USART_READY
 ******************************************************************************/
uint8_t USART_ReceiveDataIT	( USART_Handle_t *pUSARTHandle
							, uint8_t *pRxBuffer
							, uint32_t Len
							);

/*
 * IRQ Configuration and ISR handling
 */
/*******************************************************************************
 * @ingroup api_usart
 * @brief Enables or disables the corresponding IRQ
 *
 * @param[in]   IRQNumber   IRQ number
 * @param[in]	EnorDi		Enable or disable macro
 *
 ******************************************************************************/
void USART_IRQInterruptConfig	( uint8_t IRQNumber
								, uint8_t EnorDi
								);

/*******************************************************************************
 * @ingroup api_usart
 * @brief Configures the IRQ priority
 *
 * @param[in]   IRQNumber   IRQ number
 * @param[in]	IRQPriority	IRQ priority
 *
 ******************************************************************************/
void USART_IRQPriorityConfig ( uint8_t IRQNumber
							 , uint32_t IRQPriority
							 );

/*******************************************************************************
 * @ingroup api_usart
 * @brief Handles the interrupt
 *
 * @param[in]   pUSARTHandle  Reference to the USART/UART handler
 *
 ******************************************************************************/
void USART_IRQHandling(USART_Handle_t *pHandle);

/*
 * Other Peripheral Control APIs
 */
/*******************************************************************************
 * @ingroup api_usart
 * @brief Enables or disables the USART/UART peripheral
 *
 * @param[in]   pUSARTx  	Reference to the USART/UART definition structure
 * @param[in]   EnorDi  	ENABLE/DISABLE macro
 *
 ******************************************************************************/
void USART_PeripheralControl ( USART_RegDef_t *pUSARTx
							 , uint8_t EnOrDi
							 );

/*******************************************************************************
 * @ingroup api_usart
 * @brief Gets flag status from the SR register
 *
 * @param[in]   pUSARTx   	Reference to the USART/UART definition structure
 * @param[in]   FlagName   	flag name
 *
 * @return uint8_t
 * @retval FLAG_SET
 * @retval FLAG_RESET
 ******************************************************************************/
uint8_t USART_GetFlagStatus ( USART_RegDef_t *pUSARTx
							, uint32_t FlagName
							);

/** *****************************************************************************
 * @ingroup api_usart
 * @brief Clears the flag in SR register
 *
 * @param[in]   pUSARTx 		Reference to the USART/UART definition structure
 * @param[in]  	StatusFlagName	Name of flag macro
 *
 ******************************************************************************/
void USART_ClearFlag ( USART_RegDef_t *pUSARTx
					 , uint16_t StatusFlagName
					 );

/*
 * Application callback
 */
/*******************************************************************************
 * @ingroup api_usart
 * @brief Application event callback function
 *
 * @param[in]   pUSARTHandle  	Reference to the USART/UART handler
 * @param[in]   AppEv  			application event macro
 *
 ******************************************************************************/
void USART_ApplicationEventCallback(USART_Handle_t *pUSARTHandle,uint8_t AppEv);


#endif /* INC_STM32F44XX_USART_H_ */
